In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'ID': [1,2,3,4], 
                    'Ime': ['John', 'Alice', 'Bob', 'Charlie']})

df2 = pd.DataFrame({'ID': [3,4,5,6], 
                    'Prezime': ['Doe', 'Smith', 'Johnson', 'Williams']})


inner_merged = pd.merge(df1, df2, on='ID', how='inner')

In [3]:
inner_merged

   ID      Ime Prezime
0   3      Bob     Doe
1   4  Charlie   Smith

In [4]:
outer_merged = pd.merge(df1, df2, on='ID', how='outer')
outer_merged

   ID      Ime   Prezime
0   1     John       NaN
1   2    Alice       NaN
2   3      Bob       Doe
3   4  Charlie     Smith
4   5      NaN   Johnson
5   6      NaN  Williams

In [5]:
df1 = pd.DataFrame({'ID': [1,2,3,4], 
                    'Ime': ['John', 'Alice', 'Bob', 'Charlie']})

df2 = pd.DataFrame({'ID': [3,4,5,6], 
                    'Prezime': ['Doe', 'Smith', 'Johnson', 'Williams']})

left_merged = pd.merge(df1, df2, on='ID', how='left')
left_merged

   ID      Ime Prezime
0   1     John     NaN
1   2    Alice     NaN
2   3      Bob     Doe
3   4  Charlie   Smith

In [6]:
df1 = pd.DataFrame({'ID': [1,2,3,4], 
                    'Ime': ['John', 'Alice', 'Bob', 'Charlie']})

df2 = pd.DataFrame({'ID': [3,4,5,6], 
                    'Prezime': ['Doe', 'Smith', 'Johnson', 'Williams']})

right_merged = pd.merge(df1, df2, on='ID', how='right')
right_merged

   ID      Ime   Prezime
0   3      Bob       Doe
1   4  Charlie     Smith
2   5      NaN   Johnson
3   6      NaN  Williams

In [9]:
df1 = pd.DataFrame({'ID': [1,2,3,4], 
                    'Ime': ['John', 'Alice', 'Bob', 'Charlie']},
                    index=[10, 20, 30, 40])

df2 = pd.DataFrame({'Prezime': ['Doe', 'Smith', 'Johnson', 'Williams'],
                    'Godine': [25, 32, 45, 28]},
                    index=[30, 40, 50, 60])

joined_df = df1.join(df2)
joined_df

    ID      Ime Prezime  Godine
10   1     John     NaN     NaN
20   2    Alice     NaN     NaN
30   3      Bob     Doe    25.0
40   4  Charlie   Smith    32.0

In [12]:
df1 = pd.DataFrame({'ID': [1,2,3], 
                    'Ime': ['John', 'Alice', 'Bob']})

df2 = pd.DataFrame({'ID': [4,5,6], 
                    'Ime': ['Charlie', 'Dave', 'Eva']})

concatenated_df = pd.concat([df1,df2], axis=0)
concatenated_df

   ID      Ime
0   1     John
1   2    Alice
2   3      Bob
0   4  Charlie
1   5     Dave
2   6      Eva

In [13]:
df1 = pd.DataFrame({'A': [1, 2, 3],
                    'B': [10, 20, 30]})

df2 = pd.DataFrame({'A': [4, 5, 6],
                    'B': [40, 50, 60]})

def suma(x,y):
    return x+y

combined_df = df1.combine(df2, suma)
print(combined_df)

   A   B
0  5  50
1  7  70
2  9  90